---
kind: property
id: P:Autodesk.Revit.DB.Infrastructure.AlignmentStationLabelOptions.HasLeader
source: html/2cd13188-00bb-784f-17dd-b2c130f34b08.htm
---
# Autodesk.Revit.DB.Infrastructure.AlignmentStationLabelOptions.HasLeader Property

Specifies if the label will have a leader.
 The default value is true.

## Syntax (C#)
```csharp
public bool HasLeader { get; set; }
```